package com.jetcloud.hgbw.bean;

import java.util.List;

/**
 * Created by Cqing on 2017/1/11.
 */

public class FoodBean {

    /**
     * data : [{"price_cny":15,
     * "description
     * ":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":5,"pic":"/static/food/86f0fd5c-d2f0-11e6-bc0c-6807159ba7ea.jpg","kind":"A","name":"地三鲜","price_vr9":0.07,"id":6,"state":"1"},{"price_cny":15,"description":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":5,"pic":"/static/food/1b7b3a28-d2f1-11e6-b3ba-6807159ba7ea.jpg","kind":"A","name":"酸辣粉","price_vr9":0.07,"id":14,"state":"1"},{"price_cny":18,"description":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":8,"pic":"/static/food/ae2f030a-d2f0-11e6-ad9a-6807159ba7ea.png","kind":"A","name":"红烧带鱼","price_vr9":0.1,"id":8,"state":"1"},{"price_cny":16,"description":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":10,"pic":"/static/food/5a00c042-d2f1-11e6-86a0-6807159ba7ea.png","kind":"A","name":"小炒杏鲍菇","price_vr9":0.08,"id":17,"state":"1"},{"price_cny":8,"description":"分为发起违反请问人情味儿番茄沃尔夫去玩儿请问父亲我为去玩儿人废弃物额","num":5,"pic":"/static/food/4dbaabbe-d7c3-11e6-97d2-6807159ba7ea.png","kind":"B","name":"可口可乐","price_vr9":0.04,"id":28,"state":"1"},{"price_cny":30,"description":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":5,"pic":"/static/food/ef12639c-d2f0-11e6-b743-6807159ba7ea.jpg","kind":"A","name":"麻辣香锅","price_vr9":0.15,"id":12,"state":"1"},{"price_cny":8,"description":"分为发起违反请问人情味儿番茄沃尔夫去玩儿请问父亲我为去玩儿人废弃物额","num":10,"pic":"/static/food/6b739f94-d7c3-11e6-89be-6807159ba7ea.png","kind":"B","name":"橙汁","price_vr9":0.04,"id":29,"state":"1"},{"price_cny":20,"description":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":5,"pic":"/static/food/38c6d376-d2f1-11e6-a21a-6807159ba7ea.jpg","kind":"A","name":"香芹肉丝","price_vr9":0.1,"id":15,"state":"1"},{"price_cny":20,"description":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":10,"pic":"/static/food/ca4db586-d2f0-11e6-86e7-6807159ba7ea.png","kind":"A","name":"红烧排骨","price_vr9":0.11,"id":10,"state":"1"},{"price_cny":20,"description":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":10,"pic":"/static/food/e5a4bc42-d2f0-11e6-86ea-6807159ba7ea.png","kind":"A","name":"红烧肉","price_vr9":0.11,"id":11,"state":"1"},{"price_cny":7,"description":"分为发起违反请问人情味儿番茄沃尔夫去玩儿请问父亲我为去玩儿人废弃物额","num":10,"pic":"/static/food/85cadf38-d7c3-11e6-a470-6807159ba7ea.png","kind":"B","name":"苏打水","price_vr9":0.03,"id":30,"state":"1"},{"price_cny":20,"description":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":5,"pic":"/static/food/0d189ca2-d2f1-11e6-96cd-6807159ba7ea.png","kind":"A","name":"香辣翅根","price_vr9":0.1,"id":13,"state":"1"},{"price_cny":18,"description":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":10,"pic":"/static/food/be6b3310-d2f0-11e6-aaf5-6807159ba7ea.jpg","kind":"A","name":"红烧豆腐","price_vr9":0.1,"id":9,"state":"1"},{"price_cny":13,"description":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":5,"pic":"/static/food/9b521706-d2f0-11e6-b322-6807159ba7ea.png","kind":"A","name":"番茄炒蛋","price_vr9":0.07,"id":7,"state":"1"},{"price_cny":30,"description":"端上一盘红烧肉，满屋飘香口水流。此菜本非人间有，天上佳肴落街头。北宋大文豪苏东坡也对你推崇备至，焖你的皮，煮你的肉，既酥又烂，吃后口齿流香。他与你友好合作，发明创造了流传百世的\"东坡肉\"；敝人的祖先更绝，数百年前元兵南侵，我祖从中原南阳逃难，在南下的颠沛流离中，竟然还携带令人垂涎三尺的\"东坡肉\"！","num":8,"pic":"/static/food/4ab9f82e-d2f1-11e6-8199-6807159ba7ea.png","kind":"A","name":"香菇炖鸡","price_vr9":0.15,"id":16,"state":"1"}]
     * status : success
     */

    private String status;
    private List<DataBean> data;

    public String getStatus() {
        return status;
    }

    public void setStatus(String status) {
        this.status = status;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean extends ShopCarInfo{

    }
}
